var database = [
{
  "CName":"上海市",
  "Name":"上海港",
  "LAT":31.2477140071,
  "LOG":121.4978780663,
  "POLYGON":{"type":"FeatureCollection","features":[{"type":"Feature","properties":{},"geometry":{"type":"Polygon","coordinates":[[[121.541748046875,31.611287945395063],[121.3714599609375,31.423975737976722],[121.75048828124999,31.132901401103332],[122.1075439453125,31.217499361938142],[121.94274902343749,31.456782472114313],[121.67358398437499,31.53640812943961],[121.541748046875,31.611287945395063]]]}}]},
  "INTR":"上海港位于中国大陆海岸线中部，长江与东海交汇处，北纬 31 度 14 分，东经 121 度 29 分。主要交通介绍：(1)水路：上海港控江襟海，地处长三角水网地带，水路交通十分发达。沿海北距大连 558 海里 ，南距香港 823 海里 ，长江西溯重庆 2399 公里 。(2)公路：有沪宁、沪杭、沪青平、沪乍、嘉浏等高速公路与江苏和浙江对接，并联通全国高速公路网；有 204 、 312 、 318 、 320 等四条国道分别通往烟台、乌鲁木齐、拉萨和昆明。(3)铁路：港区内有铁路与沪杭沪宁铁路干线相连。其中沪宁线与津浦线联结，成为中国东部纵贯南北的运输大动脉；沪杭线与浙赣、萧甬线相衔，可通达中南、西南及浙东地区。"
},
{
  "CName":"大连市",
  "Name":"大连港",
  "LAT":38.9286262244,
  "LOG":121.6537779525,
  "POLYGON":{"type":"FeatureCollection","features":[{"type":"Feature","properties":{},"geometry":{"type":"Polygon","coordinates":[[[121.55273437499999,39.091699613104595],[121.3385009765625,39.07890809706475],[121.08032226562499,38.993572058209466],[121.058349609375,38.78406349514289],[121.33300781249999,38.698372305893294],[121.66259765625001,38.75408327579141],[121.92626953124999,38.90813299596705],[121.75598144531251,38.97222194853654],[121.67358398437499,39.04051963289309],[121.55273437499999,39.091699613104595]]]}}]},
  "INTR":"大连港位居西北太平洋的中枢，是正在兴起的东北亚经济圈的中心，是该区域进入太平洋，面向世界的海上门户。港口港阔水深，不淤不冻。自然条件非常优越，是转运远东、南亚、北美、欧洲货物最便捷的港口。港口自由水域 346 平方公里，陆地面积 10余平方公里；现有港内铁路专用线 150 余公里、仓库 30 余万平方米、货物堆场 180 万平方米、各类装卸机械千余台；拥有集装箱、原油、成品油、粮食、煤炭、散矿、化工产品，客货滚装等 80 来个现代化专业泊位，其中万吨级以上泊位 40 多个。"
},
{
  "CName":"青岛市",
  "Name":"青岛港",
  "LAT":36.0878880685,
  "LOG":120.3240661394,
  "POLYGON":{"type":"FeatureCollection","features":[{"type":"Feature","properties":{},"geometry":{"type":"Polygon","coordinates":[[[120.30990600585938,36.13510199408225],[120.27282714843749,36.08351146584746],[120.28244018554688,36.02799998329553],[120.3607177734375,36.02799998329553],[120.42388916015625,36.04521273039952],[120.40191650390625,36.05520550221327],[120.35934448242188,36.05742594589385],[120.31883239746092,36.06519700539724],[120.32020568847655,36.092944523325265],[120.32981872558594,36.1129166726066],[120.30990600585938,36.13510199408225]]]}}]},
  "INTR":"青岛港由青岛老港区、黄岛油港区、前湾新港区和董家口港区等四大港区组成。现有职工24000多人，拥有码头15座，泊位72个。世界上有多大的船舶，青岛港就有多大的码头，包括可停靠19100TEU船舶的世界最大的集装箱码头、40万吨级矿石码头、30万吨级原油码头。其中，可停靠5万吨级船舶的泊位有6个，可停靠10万吨级船舶的泊位有6个，可停靠30万吨级船舶的泊位有2个。主要从事集装箱、煤炭、原油、铁矿、粮食等进出口货物的装卸服务和国际国内客运服务。与世界上130多个国家和地区的450多个港口有贸易往来，被国务院明确定位为现代化的综合性大港和东北亚国际航运枢纽港。2014年港口完成货物吞吐量达到4.65亿吨，集装箱吞吐量突破1658万标准箱，进口原油吞吐量居中国港口第一位，集装箱装卸效率、铁矿石卸船效率始终保持世界第一。"
},
{
   "CName":"宁波市",
  "Name":"宁波港",
  "LAT":29.8771378973, 
  "LOG":122.0579421623,
  "POLYGON":{"type":"FeatureCollection","features":[{"type":"Feature","properties":{},"geometry":{"type":"Polygon","coordinates":[[[121.39892578125,29.99300228455108],[121.31103515625,29.64509464986076],[121.8548583984375,29.740532166753606],[122.20642089843749,29.888280933159265],[121.79992675781249,30.12612436422458],[121.39892578125,29.99300228455108]]]}}]},
  "INTR":"宁波港的前身是宁波港务局。宁波港由北仑港区、镇海港区、宁波港区、大榭港区、穿山港区组成，是一个集内河港、河口港和海港于一体的多功能、综合性的现代化深水大港。现有生产性泊位309座，其中万吨级以上深水泊位60座。最大的有25万吨级原油码头，20万吨级（9可兼靠30万吨船）的卸矿码头，第六代国际集装箱专用泊位以及5万吨级液体化工专用泊位；已与世界上100多个国家和地区的600多个港口通航。2012年3月，国务院批复同意开放宁波港梅山港区。2013年，宁波舟山组合港全年货物吞吐量达到8.09亿吨，超越上海港，位居世界第一。2014年度宁波舟山港实现货物总吞吐量8.73亿吨，牢牢占据货物总吞吐量世界第一大港的宝座。"

},
{
  "CName":"天津市",
  "Name":"天津港",
  "LAT":39.0046207689, 
  "LOG":117.7370575482,
  "POLYGON":{"type":"FeatureCollection","features":[{"type":"Feature","properties":{},"geometry":{"type":"Polygon","coordinates":[[[117.73223876953124,39.144972625112224],[117.53173828125,38.91668153637508],[117.48229980468749,38.7283759182398],[117.53448486328125,38.649053322140226],[117.69378662109375,38.76693348394696],[117.784423828125,38.882481197550774],[117.784423828125,38.98503278695909],[117.76245117187499,39.06398173012625],[117.73223876953124,39.144972625112224]]]}}]},
  "INTR":"天津港，也称天津新港，位于中华人民共和国天津市海河入海口，处于京津冀城市群和环渤海经济圈的交汇点上，是中国北方最大的综合性港口和重要的对外贸易口岸。天津港是在淤泥质浅滩上挖海建港、吹填造陆建成的世界航道等级最高的人工深水港.目前，天津港主航道水深已达21米，可满足30万吨级原油船舶和国际上最先进的集装箱船进出港。2013年天津港货物吞吐量首次突破5亿吨，集装箱吞吐量突破1300万标准箱，成为中国北方第一个5亿吨港口。2014年1月1日，中国第一条人工开挖的复试航道在天津港正式通航。2015年03月04日，天津将投160亿元建设天津港。"

}
];